app/Controllers/Main.php

    function seznam(){


        $data['tymy'] = $this->sezT->orderBy('tymy_idtymy','nazev','rok_zalozeni','asc')->where('sezona_idsezona',1);
        $data["Propojene_Data"]=$this->sezT->join("tymy",'tymy_has_liga_sezona.tymy_idtymy=tymy.idtymy','inner')->findAll();
---
SELECT *
FROM `liga_tymy_has_liga_sezona`
INNER JOIN `liga_tymy` ON `liga_tymy_has_liga_sezona`.`tymy_idtymy`=`liga_tymy`.`idtymy`
WHERE `sezona_idsezona` = 1
ORDER BY `tymy_idtymy`

function pozice(){
    $data["data"] = $this->poz->orderBy("idpozice", "asc")->findAll();
---
SELECT *
FROM `liga_pozice`
ORDER BY `idpozice` ASC

function stadiony(){
    $pagd = $this->Config->pagd;
    $data["data"] = $this->sta->orderBy('idstadion','asc')->paginate($pagd);
---
SELECT *
FROM `liga_stadion`
WHERE `liga_stadion`.`deleted_at` IS NULL
ORDER BY `idstadion` ASC
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `liga_stadion`
WHERE `liga_stadion`.`deleted_at` IS NULL